import math

Number = 0
a = 0
s = set()
while True:
    Number = float(input())
    if Number == 0:
        break
    else:
        s.add(Number)
        for i in s: 
              print("%f, %.2f"%(i,(i / 360 * math.pi * 2)))
# В программе вводятся целые числа пока не будет введено число 0. Необходимо для каждого введенного
# числа вычислить косинус и вывести на экран с точностью до тысячных. Если числовое значение вводится повторно,
# то заново его вычислять не нужно, а брать ранее вычисленное значение из словаря.